app/controllers/comment_controller.rb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123"], ["post_id", 1], ["created_at", 2017-04-03 16:12:52 UTC], ["updated_at", 2017-04-03 16:12:52 UTC]]
---
  def create
    newComment = Comment.new
    newComment.content = params[:content]
    newComment.post_id = params[:post_id]
    newComment.user = current_user
    newComment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    destroyComment = Comment.find(params[:comment_id])
    destroyComment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "123"], ["updated_at", 2017-04-03 16:26:13 UTC], ["id", 2]]
---
  def update
    updateComment = Comment.find(params[:comment_id])
    updateComment.content = params[:content]
    updateComment.save