app/controllers/post_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1"], ["content", "1"], ["created_at", 2017-04-03 15:55:35 UTC], ["updated_at", 2017-04-03 15:55:35 UTC]]
---
  def create
    newPost = Post.new
    newPost.title = params[:title]
    newPost.content = params[:content]
    newPost.user = current_user
    newPost.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    destroyPost = Post.find(params[:id])
    destroyPost.destroy

SELECT "posts".* FROM "posts"
---
  def index
    @listPost = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @showPost = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @editPost = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ㄱ갓선재 ㄸㄷ"], ["content", "크으"], ["updated_at", 2017-04-10 12:53:45 UTC], ["id", 2]]
---
  def update
    updatePost = Post.find(params[:id])
    updatePost.title = params[:title]
    updatePost.content = params[:content]
    updatePost.save